app/controllers/comments_controller.rb

SELECT * FROM "comments" ORDER BY rank desc LIMIT 15 OFFSET 0
SELECT count(*) AS count_all FROM "comments" WHERE ("comments".commentable_id = 3 AND "comments".commentable_type = E'Comment')
---
  def top_ranked
    @comments = Comment.top_ranked.paginate(:page => params[:page])

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
---
  def reply
    @comment = Comment.find(params[:id])

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
---
  def edit
    @comment = Comment.find(params[:id])

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
UPDATE "comments" SET "updated_at" = '2009-10-02 23:05:53.388623', "text" = E'<b>Awesome</b>' WHERE "id" = 1
---
  def update
    @comment = Comment.find(params[:id])
    @comment.update_attributes!(params[:comment])

SELECT * FROM "comments" WHERE ("comments".parent_id = 4)
DELETE FROM "comments" WHERE "id" = 4
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy