app/controllers/posts_controller.rb

  def top_ranked
    @posts = Post.top_ranked.paginate(:page => params[:page])
---
SELECT * FROM "posts" ORDER BY rank desc LIMIT 15 OFFSET 0
SELECT count(*) AS count_all FROM "posts" LIMIT 250

  def latest
    @posts = Post.latest.paginate(:page => params[:page])
---
SELECT * FROM "posts" WHERE (created_at > '2009-07-04 05:56:21.397624') ORDER BY created_at desc LIMIT 15 OFFSET 0
SELECT count(*) AS count_all FROM "posts" WHERE (created_at > '2009-07-04 05:56:21.397624') LIMIT 250

  def create
    @user = User.find(current_user)
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def edit
    session['referer'] ||= request.referer
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def update
    @post = Post.find(params[:id])
    @post.update_attributes!(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2009-10-02 23:05:28.559579', "url" = E'http://jurisgalang.com' WHERE "id" = 1