app/controllers/posts_controller.rb

  def create
    @user = User.find current_user
    if @post = Post.was_submitted_before?(params[:post])
      flash[:notice] = 'WARN: Someone already submitted the same thing, please join in the discussion instead.'
      redirect_to post_comments_url(@post)
      return
    end

    @post        = Post.new(params[:post])
    @post.author = @user
    if @post.save
---
INSERT INTO "posts" ("created_at", "title", "section_id", "updated_at", "url", "text", "points", "rank", "user_id", "comments_count") VALUES('2009-10-02 23:05:07.040946', E'Test', 1, '2009-10-02 23:05:07.040946', E'', E'', 1, 0.0, 1, 0) RETURNING "id"