app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    raise 'CAPTCHA validation failed' unless Recaptcha.verify(RECAPTCHA_PRIVATE_KEY, request.remote_ip, params)
    if @user.save
---
INSERT INTO "users" ("activation_key", "created_at", "updated_at", "admin", "lastname", "points", "posts_count", "reset_key", "firstname", "alias", "reset_expires_at", "comments_count", "password", "activation_expires_at", "email") VALUES(E'c5169d769a593f3833c81e854d45d0e7786adf42644f532a783bdd14a76287e3', '2009-10-02 19:58:56.512693', '2009-10-02 19:58:56.512693', 'f', E'Galang', 1, 0, NULL, E'Juris', NULL, '2009-10-01 22:23:24.213471', 0, E'90dfcef3fa2b69d01a75d6aa9bad3d4f55ed83bd331e1331836dbd7899075e69bd407c41887b537b175fd40672f49035d68afcff08cf2449549c487339a30ab89IG0wTeqHf6P1KdWtFC1amOcPArAO4SngXAoVBQexaSrUvf6FbhHf9fdAmpMgjNk', '2009-10-16 19:58:56.357326', E'iG+K8t7S1EZM6cXQQZU9N88cxElRLh42kGKz9qjNhkQ=

  def edit
    @user = User.find current_user
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def update
    @user = User.find current_user
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2009-10-02 17:40:47.247301', "alias" = E'', "password" = E'e5f420f407dc3032bacd5e3a8d749355d930e3d6975d91e023c5fff7c41a43fe580a1ab16325a76aded44fd03680995a7d11a6c4dbc594d77c558cb97bc59394tCRnbEi4BkrzVgxT3pO5eYQsLcWgChbiNyA79GHOwbPoTMQsGNJc3lxPfUHLyApP' WHERE "id" = 5

  def reset
    case
    # request password reset
    when request.post?
      email = params[:user][:email]
      if email.blank?
        @user = User.new
        render :action => :login
      else
        User.configure_for_reset(email)
        flash[:notice] = "Reset confirmation sent to #{email}"
        redirect_to login_url
      end

    # update password (because of reset request)
    when request.put?
      password =  params[:user][:password]
      @user    = User.reset(params[:key], password) || User.new
      if @user.new_record?
        flash.now[:notice] = 'ERROR: There was a problem with your changes, please try again.'
        render :action => :reset
      else
        flash[:notice] = 'Password changed.'
        authorize(:nickname => @user.nickname, :password => password)
        redirect_to edit_user_url(@user)
      end

    # edit password (because of reset request)
    when request.get?
      @user = User.find_by_reset_key(params[:key])
---
SELECT "users".id FROM "users" WHERE (LOWER("users"."email") = E'jurisgalang@gmail.com' AND "users".id <> 7) LIMIT 1
SELECT * FROM "users" WHERE ("users"."reset_key" = E'b181c88ac0e0d2ec34bff38127859dae47372f422d2901cc3d286e4889060969') LIMIT 1